[
    {'name': 'Mountain Taste of Hyderabad','reviews': ["I recently dined at Mountain Taste of Hyderabad, a multi-cuisine restaurant located in Banjara Hills. The restaurant boasts two floors for dining, but unfortunately, that's where the positives end.\n\nThe ambiance of the place is quite basic and lacks any special touches. In fact, if you pay close attention, you'll notice that the lights are falling in multiple places, which is certainly off-putting.\n\nAccording to the restaurant, their best offering is the Biryani. However, I was left disappointed as I found it to be very dry and lacking in taste. The flavors just didn't come together as expected, which was quite disappointing.\n\nAnother downside of this restaurant is the unprofessional and untrained staff. There were a lot of goof ups by the staff, but to my surprise, the owner sitting at the cash counter seemed indifferent to these issues. It was disheartening to witness such a lack of concern for service quality.\n\nOn a positive note, the restaurant does offer valet parking, which is a convenient service, particularly in Banjara Hills where parking can be a challenge.\n\nHowever, when it comes to the food, it's safe to say that you can find better options in the area, especially considering the distance you may have traveled to reach Banjara Hills. Mountain Taste of Hyderabad falls short in terms of taste and overall dining experience.\n\nAll in all, if you're in search of a fantastic dining experience or delicious Biryani, I would recommend exploring other options in the area.", 'Loved the food! Will be going there more often, so much more to try ! Among the things we had were some kebabs, prawn cocktail , stuffed chicken but today\'s show stopper was the "Jugalbandi" dessert for us ! Who would have thought these two traditional sweets would come together to form a beautiful friendship !', 'Firstly we have been regular customers of Mount Bakery so as soon as we saw a restaurant opened by them we immediately changed our plans and visited them for dinner. Love the menu, it has got the Nizam flavours. Started with Marag for soupe and then ordered the Nonveg platter and the taste is good. The chairs have a retro look and the place is well lit. People who like the Nizam style of food should definitely check this out.', "It's a newly opened place in Banjara hills which serves Hyderabad cuisines. Interiors look simple but clean. They are open till 11:30 pm.\n\nOrdered biryani which took a while to arrive. One biryani is not enough for even 2 people with small appetite.\n\nTaking about taste, I believe that food specially biryani should have a fragrance which was totally missing. Hardly any flavour.\n\nService and cutlery was good but they definitely need to focus more on the chef.\n\nThanks", "Mountain Taste of Hyderabad is a delightful restaurant that offers a diverse menu catering to various tastes. The ambiance is cozy and inviting, making it an ideal spot for both casual dining and special occasions. The staff is friendly and attentive, ensuring a pleasant dining experience. From flavorful appetizers to satisfying main courses, every dish is prepared with care and quality ingredients. Whether you're in the mood for something familiar or looking to try something new, Mountain Taste of Hyderabad is a great choice for a memorable meal."]}, 
    {'name': 'Jewel Of Nizam', 'reviews': ['Wonderfully decorated with nizami esthetic decor. Ambience is really good. Paneer kulcha, Murg mazedaar , chatpata Machi were really tasty. Barkas pathar ghost, boti kabab were not good. For the  very High prices the quantity of food was very less. Visit mostly for the ambience. Complimentary Paan varieties were also given.', "A very beautiful authentic ambience is there. Coming to the taste it's average taste. Personal I liked the Mutton Rogan Gosh with the butter naan. Biriyani in not upto mark. And Khurbani ka mittha also not good. Overall you can visit this place one time for that ambience and aroma.", "While the ambiance was undeniably aesthetic, the food sadly didn't live up to the hype. Overpriced and underwhelming, the dishes failed to meet my expectations. To make matters worse, the service was slow and sluggish, adding to the disappointment. Perhaps with a bit more attention to culinary quality and speed of service, this place could truly shine", 'A very authentic hyderababi place for a lavish meal. Great ambience and excellent food. The place has history and legacy, which are up on the walls to see, right from the time of the nizams.\n\nFood is a bit on the spicier side, so if you are not too comfortable with it… watch out', 'Most starters were good. We ordered mutton biryani which was spicy without flavors. It was below average for taste, and for the price it can be rated as horrible.']}, 
    {'name': 'Jewel of Nizam - The Minar','reviews': ['Average food but the ambience is beyond grand. It feels like a private restaurant and the service is impeccable. We really enjoyed the non veg buffet on offer and the assortment of drinks they served a-la-carte. The place is located a bit ourside the city overlooking a lake which makes way for scenic pictures, its just enchanting if you go during day time.', 'Very tasty\nThe ambience was top notch\nOka royal villa la untundi\nFood was delicious\nDo you want to njoy ur weekend do visit have a try 🤤', 'I recently visited Jewel of Nizam, and it was an experience to remember. The restaurant exudes a grand, Nawabi atmosphere with regal decor, making you feel like royalty. Situated slightly outside the city, it offers a peaceful escape, and every section is beautifully designed, allowing you to truly enjoy the ambiance.\n\nWhile the food itself was average, the luxurious setting and attentive service make it worth a visit. If you’re looking for a place with a rich, royal vibe, this is definitely one to visit at least once.', 'Very good experience, ambience and good service. Location is also very good. Must try place in Hyderabad', "I am writing to express my utter disappointment and frustration with the horrendous dining experience my party and I endured at Jewel of Nizam last night. For a restaurant that demands INR 2,000 per person as cover charge upfront before even allocating a seat, the service and conditions were disgraceful.\nVisiting Hyderabad for the first time from London, I was excited to explore fine dining establishments along with my family, but the experience we had at your restaurant was far from acceptable.\n\nHere are the unacceptable issues we faced: 1. Welcome Drinks: We were a group of five but received only four welcome drinks. When we pointed this out, the waiter never returned with the missing drink. It took 2 follow ups to get the drink and even then the server came with 2 drinks (again missing the total count).\n\n2. Cutlery: The cutlery (butter knife) had visible food remnants, which was not only unhygienic but outright disgusting.\n\nIn response to these issues, we were given with an average cranberry mocktail as compensation. Unfortunately, the problems did not end there:\n\n3. Service: The service was painfully slow, with our starters arriving approximately 40 minutes later. Moreover, the server was incredibly inattentive and seemed completely untrained and lost upon questions asked on recommendations, displaying a terrible attitude throughout.\n\n4. Washrooms: The washrooms were in a shameful state, literally comparable to those at a roadside dhaba. The irony of having a Maharani's picture on the door while the facilities inside were filthy is beyond comprehension. This level of service and cleanliness is unacceptable for any dining establishment, let alone one that charges a premium upfront or prides itself as a fine dine restaurant. The washroom was the perfect place to get several infections for anyone why used it!!!\n\nWhen we shared the images and requested contact information for escalation, the restaurant manager initially resisted sharing it. Only after multiple follow-ups did we finally receive this email address."]}
]